hw-acceptance-unit-test-cycle-master/rottenpotatoes/app/controllers/movies_controller.rb

  def show
    # debugger
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]